[
  {
    "title": "Як обрати пароль",
    "blockOne": {
      "1": "Формат паролю задає розробник продукту в залежності від того, наскільки чутливу інформацію ви йому довіряєте.",
      "2": "Зазвичай обов`язковим є використання великих і малих літер, цифр, спеціального знаку.",
      "3": "Вигадайте і запам`ятайте пару емоційних для вас слів - імен, міст України - запишіть і розділіть їх цифрою, цього буде достатньо для складності."
    },
    "blockTwo": { "1": "...", "2": "..." }
  },
  {
    "title": "Як змінити пароль до акаунту в Facebook",
    "blockOne": {
      "1": "На основному фото вгорі праворуч натисніть стрілочку вниз. Оберіть Налаштування. Оберіть зліва розділ Пароль і безпека.",
      "2": "Натисніть Змінити пароль, після чого натисніть на обліковому записі, який потрібно оновити.",
      "3": "Введіть поточний і новий паролі. Натисніть Змінити пароль."
    },

    "blockTwo": {
      "1": "Змініть пароль, якщо підозрюєте, що хтось зламав ваш акаунт, і ви помітили незвичні дії, яких ви не виконували.",
      "2": "Використайте нову комбінацію літер і цифр, несхожу на попередню, щоб не допустити підбору паролю."
    }
  },
  {
    "title": "Що таке двофакторна аутентифікація",
    "blockOne": {
      "1": "Це спосіб, який гарантує, що доступ до ваших даних маєте тільки ви, навіть якщо ваш пароль потрапив до когось іншого.",
      "2": "Аутентифікація - це підтвердження, що ви - це саме ви. Перший фактор підтвердження - пароль, який ви встановлюєте до електронної пошти. Другий - найчастіше це СМС, що приходить на запит на ваш номер телефона.",
      "3": "Оскільки два фактори захисту розведені по різних гаджетах, це вас захищає вдвічі надійніше."
    },

    "blockTwo": {
      "1": "Більшість цифрових продуктів - пошти або банківського сервісу пропонують вам встановити двофакторну аутентифікацію, коли ви реєструєтесь в сервісі.",
      "2": "Не нехтуйте цим способом, особливо коли йдеться про банківські дані - так ви максимально захистите себе від крадіжки коштів.",
      "3": "Існує близько шести способів аутентифікації крім названих - також відбиток пальця, кодове слово та інші."
    }
  },
  {
    "title": "Як встановити антивірус",
    "blockOne": {
      "1": "Оберіть розробника антивірусної програми. Вони бувають безкоштовні і платні, для різних гаджетів, для всієї родини або одного комп`ютера.",
      "2": "Знайдіть на офіційному сайті розробника кнопку Download. Це програма, яка автоматично запуститься, щоб встановитись на ваш пристрій.",
      "3": "Натисніть її і дочекайтесь, поки процес встановлення завершиться. Підтверджуйте ті налаштування, які запропонує вам програма, фактично вони універсальні."
    },

    "blockTwo": {
      "1": "Антивірусна програма захистить ваш пристрій від атак з зовнішньої сторони - з інтернету.",
      "2": "В операційній системі Windows встановлено автоматичний антивірус Microsoft Defender - він є досить надійним, якщо ви користуєтесь офіційною версією ОС."
    }
  }
]
